hurrican/hurrican-acceptance-test/src/citrus/resources/templates/resourceorder/v1/Resource_Order_Management/reservePortSuccessNotification.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <notifyPortOrderUpdate
                xmlns="http://www.mnet.de/esb/cdm/Resource/ResourceOrderManagementNotificationService/v1">
            <orderId>${orderId}</orderId>
            <notificationType>${notificationType}</notificationType>
            <notification>
                <lineId>${lineId}</lineId>
                <executionDate>${desiredExecutionDate}</executionDate>
                <notificationDetail>
                    <key>HURRICAN_AUFTRAGS_ID</key>
                    <value>@ignore@</value>
                </notificationDetail>
                <notificationDetail>
                    <key>DPO_NOCH_NICHT_VERBAUT</key>
                    <value>@ignore@</value>
                </notificationDetail>
                <notificationDetail>
                    <key>A10NSP</key>
                    <value>@ignore@</value>
                </notificationDetail>
                <notificationDetail>
                    <key>A10NSP_PORT</key>
                    <value>@ignore@</value>
                </notificationDetail>
                <notificationDetail>
                    <key>SVLAN_EKP</key>
                    <value>@ignore@</value>
                </notificationDetail>
            </notification>
        </notifyPortOrderUpdate>
    </soap:Body>
</soap:Envelope>