hurrican/hurrican-acceptance-test/src/citrus/resources/templates/resourceorder/v1/Resource_Order_Management/bauauftragChangedResponse.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <notifyPortOrderUpdate
                xmlns="http://www.mnet.de/esb/cdm/Resource/ResourceOrderManagementNotificationService/v1">
            <orderId>${orderId}</orderId>
            <notificationType>${notificationType}</notificationType>
            <notification/>
        </notifyPortOrderUpdate>
    </soap:Body>
</soap:Envelope>